//
//  Question.swift
//  Psychometric test
//
//  Created by Kai on 2023/3/9.
//

import Foundation

struct Qna {
    var question: String
    var option: [String]
    var result: [String]
    var song: [String]
}




//var totalQna = [
//    Qna(question: "在夢中你走進了一個森林，看見了 ＿＿＿＿＿", option: ["A.高大的神木群":"你希望自己能夠主導關係，所以有時候會不自覺地流露出一股壓人的氣勢，讓人有壓力。","B.美麗的湖泊":"大家都喜歡善解人意的你，但是距離就是美感，或許他們不是那麼了解你。","C.滿地叢生的植物":"與身邊人相處時，你總希望能給彼此一點空間，但卻又不希望自己被冷落，實在有點難捉摸。"]),
//    Qna(question: "這時在你背後忽然出現了 ＿＿＿＿＿", option: ["A.人馬":"你是個比較獨立的人，做什麼都喜歡自己處理，所以會希望朋友不要過度依賴自己。","B.獨角獸":"你是個溫柔善良的人，不太會強迫或批判朋友，而是會選擇當傾聽的一方。","C.雄鹿":"你是個比較強勢的人，就算給對方選擇，但其實也已經暗示了你的想法，因此有時會讓人感到壓迫。"]),
//    Qna(question: "面對這個未知生物，你決定 ＿＿＿＿＿", option: ["A.一步一步往前示好":"你的控制慾不算強，因為你認為人與人之間相處，本來就該保有一定的空間，即便是另一半也是一樣。","B.想辦法嚇唬讓牠後退":"不安感加深了你的控制慾，你希望每件事都能在自己的掌握中，最好是沒有任何意外。","":""])]


